<a href="https://colab.research.google.com/github/BhuvneshSain/my-notebooks/blob/master/DCS_python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [21]:
import pandas as pd
import numpy as np

In [22]:
l1=[10,20,30,40,50]
l2=['a','b','c','d','e']


pd.DataFrame({'Col1':l1,'Col2':l2})
df=pd.DataFrame(zip(l1,l2))
df

    0  1
0  10  a
1  20  b
2  30  c
3  40  d
4  50  e

In [38]:
df.index=['azx','ddd','c','bd','cd']
df.sort_index()

      0  1
azx  10  a
bd   40  d
c    30  c
cd   50  e
ddd  20  b

In [33]:
import string
list(string.ascii_uppercase)

['A',
 'B',
 'C',
 'D',
 'E',
 'F',
 'G',
 'H',
 'I',
 'J',
 'K',
 'L',
 'M',
 'N',
 'O',
 'P',
 'Q',
 'R',
 'S',
 'T',
 'U',
 'V',
 'W',
 'X',
 'Y',
 'Z']

In [ ]:
df.fillna(value=20)

      0  1
0  20.0  a
1  20.0  b
2  30.0  c
3  40.0  d
4  50.0  e

In [ ]:
df['col3']=l2
#add columns with values
df

    0  1 col3
0  10  a    a
1  20  b    b
2  30  c    c
3  40  d    d
4  50  e    e

In [ ]:
df.loc[5]=[70,'f',104]
df
#add row
df.append(pd.Series([70,'f',104],index=df.columns),ignore_index=True)
df

    0  1 col3
0  10  a    a
1  20  b    b
2  30  c    c
3  40  d    d
4  50  e    e
5  70  f  104
5  70  f  104

In [43]:
list(map(lambda x:x*2,[10,20,30]))

[20, 40, 60]

In [52]:
list(map(lambda x,y:x+y,[10,20],[20,30]))

[30, 50]

In [56]:
import functools
functools.reduce()

TypeError: ignored